## staging: performance-test
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 3 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                    NAME                                     |
|----------|-----------------------------------------------------------------------------|
| delete   | `aws_secretsmanager_secret.perf_test_auth_header[0]`                        |
|          | `aws_secretsmanager_secret_version.perf_test_auth_header[0]`                |
| update   | `aws_cloudwatch_event_target.ecs_scheduled_task[0]`                         |
|          | `aws_iam_policy.perf_test_secretsmanager`                                   |
|          | `aws_iam_role_policy.scheduled_task_perf_test_event_role_cloudwatch_policy` |
| recreate | `aws_ecs_task_definition.perf_test_task`                                    |
| add      | `aws_secretsmanager_secret.perf_test_api_key[0]`                            |
|          | `aws_secretsmanager_secret_version.perf_test_api_key[0]`                    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.perf_test_secretsmanager will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "perf_test_secretsmanager" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_domain-WSUpwW",
              + "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_email-sWnA9Z",
              + "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_phone_number-DWkOGY",
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.scheduled_task_perf_test_event_role_cloudwatch_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "scheduled_task_perf_test_event_role_cloudwatch_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ecs:RunTask",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + "arn:aws:iam::239043911459:role/container_execution_role",
              + "arn:aws:iam::239043911459:role/performance_test_cluster-ecs-task",
            ]
        }
    }

  # data.template_file.perf_test_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "perf_test_container_definition" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "PERF_TEST_AWS_S3_BUCKET"
                          + value = "${PERF_TEST_AWS_S3_BUCKET}"
                        },
                      + {
                          + name  = "PERF_TEST_CSV_DIRECTORY_PATH"
                          + value = "${PERF_TEST_CSV_DIRECTORY_PATH}"
                        },
                      + {
                          + name  = "PERF_TEST_SMS_TEMPLATE_ID_ONE_VAR"
                          + value = "${PERF_TEST_SMS_TEMPLATE_ID_ONE_VAR}"
                        },
                      + {
                          + name  = "PERF_TEST_EMAIL_TEMPLATE_ID_ONE_VAR"
                          + value = "${PERF_TEST_EMAIL_TEMPLATE_ID_ONE_VAR}"
                        },
                    ]
                  + essential        = true
                  + image            = "${ECR_REPOSITORY_URL}"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${AWS_LOGS_GROUP}"
                          + awslogs-region        = "${AWS_LOGS_REGION}"
                          + awslogs-stream-prefix = "${AWS_LOGS_STREAM_PREFIX}"
                        }
                    }
                  + name             = "performance-tests-container"
                  + secrets          = [
                      + {
                          + name      = "PERF_TEST_PHONE_NUMBER"
                          + valueFrom = "${PERF_TEST_PHONE_NUMBER_ARN}"
                        },
                      + {
                          + name      = "PERF_TEST_EMAIL_ADDRESS"
                          + valueFrom = "${PERF_TEST_EMAIL_ARN}"
                        },
                      + {
                          + name      = "PERF_TEST_DOMAIN"
                          + valueFrom = "${PERF_TEST_DOMAIN_ARN}"
                        },
                      + {
                          + name      = "PERF_TEST_API_KEY"
                          + valueFrom = "${PERF_TEST_API_KEY_ARN}"
                        },
                    ]
                  + ulimits          = [
                      + {
                          + hardLimit = 98304
                          + name      = "nofile"
                          + softLimit = 98304
                        },
                    ]
                  + volumesFrom      = []
                },
            ]
        )
      + vars     = {
          + "AWS_LOGS_GROUP"                      = "performance_test_cluster"
          + "AWS_LOGS_REGION"                     = "ca-central-1"
          + "AWS_LOGS_STREAM_PREFIX"              = "performance_test_cluster-task"
          + "ECR_REPOSITORY_URL"                  = "239043911459.dkr.ecr.ca-central-1.amazonaws.com/notify/performance-test"
          + "PERF_TEST_API_KEY_ARN"               = (known after apply)
          + "PERF_TEST_AWS_S3_BUCKET"             = "notify-performance-test-results-staging"
          + "PERF_TEST_CSV_DIRECTORY_PATH"        = "/tmp/notify_performance_test"
          + "PERF_TEST_DOMAIN_ARN"                = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_domain-WSUpwW"
          + "PERF_TEST_EMAIL_ARN"                 = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_email-sWnA9Z"
          + "PERF_TEST_EMAIL_TEMPLATE_ID_ONE_VAR" = "9fb324a5-821d-4b54-9d52-d9ba1fa8373a"
          + "PERF_TEST_PHONE_NUMBER_ARN"          = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_phone_number-DWkOGY"
          + "PERF_TEST_SMS_TEMPLATE_ID_ONE_VAR"   = "8048cc75-dfcf-45a0-984c-1585fe6e9880"
        }
    }

  # aws_cloudwatch_event_target.ecs_scheduled_task[0] will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "perf_test_event_rule-terraform-20211129205416437200000001"
        # (8 unchanged attributes hidden)

      ~ ecs_target {
            tags                    = {
                "CostCenter" = "notification-canada-ca-staging"
            }
          ~ task_definition_arn     = "arn:aws:ecs:ca-central-1:239043911459:task-definition/performance_test_cluster:9" -> (known after apply)
            # (7 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # aws_ecs_task_definition.perf_test_task must be replaced
-/+ resource "aws_ecs_task_definition" "perf_test_task" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:239043911459:task-definition/performance_test_cluster:9" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:239043911459:task-definition/performance_test_cluster" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "PERF_TEST_AWS_S3_BUCKET"
                          - value = "notify-performance-test-results-staging"
                        },
                      - {
                          - name  = "PERF_TEST_BULK_EMAIL_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_CSV_DIRECTORY_PATH"
                          - value = "/tmp/notify_performance_test"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_WITH_ATTACHMENT_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_WITH_LINK_TEMPLATE_ID"
                          - value = "9fb324a5-821d-4b54-9d52-d9ba1fa8373a"
                        },
                      - {
                          - name  = "PERF_TEST_SMS_TEMPLATE_ID"
                          - value = "d5fea9f3-f69d-481e-9186-b7f4eaa5cf63"
                        },
                    ]
                  - essential        = true
                  - image            = "239043911459.dkr.ecr.ca-central-1.amazonaws.com/notify/performance-test"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "performance_test_cluster"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "performance_test_cluster-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "performance-tests-container"
                  - portMappings     = []
                  - secrets          = [
                      - {
                          - name      = "PERF_TEST_AUTH_HEADER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_auth_header-PxFUOL"
                        },
                      - {
                          - name      = "PERF_TEST_DOMAIN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_domain-WSUpwW"
                        },
                      - {
                          - name      = "PERF_TEST_EMAIL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_email-sWnA9Z"
                        },
                      - {
                          - name      = "PERF_TEST_PHONE_NUMBER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_phone_number-DWkOGY"
                        },
                    ]
                  - systemControls   = []
                  - ulimits          = [
                      - {
                          - hardLimit = 98304
                          - name      = "nofile"
                          - softLimit = 98304
                        },
                    ]
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "performance_test_cluster" -> (known after apply)
      ~ revision                 = 9 -> (known after apply)
        tags                     = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_iam_policy.perf_test_secretsmanager will be updated in-place
  ~ resource "aws_iam_policy" "perf_test_secretsmanager" {
        id               = "arn:aws:iam::239043911459:policy/PerfTestEcsTaskGetSecretValue"
        name             = "PerfTestEcsTaskGetSecretValue"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_phone_number-DWkOGY",
                          - "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_email-sWnA9Z",
                          - "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_domain-WSUpwW",
                          - "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_auth_header-PxFUOL",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_role_policy.scheduled_task_perf_test_event_role_cloudwatch_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "scheduled_task_perf_test_event_role_cloudwatch_policy" {
        id          = "perf_test_scheduled_task_role:performance_test_cluster-ecs-scheduled-policy"
        name        = "performance_test_cluster-ecs-scheduled-policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ecs:RunTask"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecs:ca-central-1:239043911459:task-definition/performance_test_cluster:9"
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::239043911459:role/performance_test_cluster-ecs-task",
                          - "arn:aws:iam::239043911459:role/container_execution_role",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.perf_test_api_key[0] will be created
  + resource "aws_secretsmanager_secret" "perf_test_api_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "perf_test_api_key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.perf_test_auth_header[0] will be destroyed
  # (because aws_secretsmanager_secret.perf_test_auth_header is not in configuration)
  - resource "aws_secretsmanager_secret" "perf_test_auth_header" {
      - arn                            = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_auth_header-PxFUOL" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_auth_header-PxFUOL" -> null
      - name                           = "perf_test_auth_header" -> null
      - recovery_window_in_days        = 0 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.perf_test_api_key[0] will be created
  + resource "aws_secretsmanager_secret_version" "perf_test_api_key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.perf_test_auth_header[0] will be destroyed
  # (because aws_secretsmanager_secret_version.perf_test_auth_header is not in configuration)
  - resource "aws_secretsmanager_secret_version" "perf_test_auth_header" {
      - arn            = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_auth_header-PxFUOL" -> null
      - id             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_auth_header-PxFUOL|terraform-20240404205110719800000001" -> null
      - secret_id      = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_auth_header-PxFUOL" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20240404205110719800000001" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 3 to change, 3 to destroy.

Warning: Argument is deprecated

  with module.notify_performance_test_results.aws_s3_bucket.this,
  on .terraform/modules/notify_performance_test_results/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

